# GetSupports Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRail..::..GetSupports Method
ContinuousRail Class See Also
---
Returns all the railing supports attached to the rail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ElementId> GetSupports()
```

Visual Basic
---
```text
Public Function GetSupports As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetSupports()
```

# See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace